Data/TestFiles/cases/BatteryCooling/case/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 200.0;

boundaryField
{

    battery
    {
        type        epsilonWallFunction;
        value       $internalField;
    }

    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.02025;
        value           $internalField;
    }

    outlet
    {
        type        inletOutlet;
        inletValue  $internalField;
        value       $internalField;
    }

    wall
    {
        type        epsilonWallFunction;
        value       $internalField;
    }

    defaultFaces
    {
        type        epsilonWallFunction;
        value       $internalField;
    }

}

// ************************************************************************* //
